In [1]:
import pandas as pd

### Создаём датафрейм authors

In [2]:
a = {
    "author_id": [1, 2, 3],
    "author_name": ["Тургенев", "Чехов", "Островский"]
}

authors = pd.DataFrame(a)

authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

### Создаём датафрейм books

In [6]:
books = pd.DataFrame({
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ["Отцы и дети", "Рудин", "Дворянское гнездо", "Толстый и тонкий", "Дама с собачкой", "Гроза", "Таланты и поклонники"],
    "price": [450, 300, 350, 500, 450, 370, 290]
})

books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Получаем датафрейм authors_price

In [4]:
authors_price = pd.merge(authors, books, on='author_id', how='outer')

authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Создаём датафрейм top5

In [7]:
top5 = authors_price.sort_values(by="price").tail(5)

top5.reset_index(drop=True, inplace=True)

top5

   author_id author_name         book_title  price
0          1    Тургенев  Дворянское гнездо    350
1          3  Островский              Гроза    370
2          1    Тургенев        Отцы и дети    450
3          2       Чехов    Дама с собачкой    450
4          2       Чехов   Толстый и тонкий    500

### Создаём датафрейм authors_stat